
&НаСервере
Процедура ПриОткрытииНаСервере()
	Товары.Очистить();
	Дата=НаименованиеЗаказа.Дата;
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ЗаказыТовары.Товар КАК Товар,
	             |	ЗаказыТовары.Количество КАК Количество
	             |ИЗ
	             |	Документ.Заказы.Товары КАК ЗаказыТовары
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заказы КАК Заказы
	             |		ПО ЗаказыТовары.Ссылка = Заказы.Ссылка
	             |ГДЕ
	             |	Заказы.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", НаименованиеЗаказа);
	Результат=Запрос.Выполнить();
	Выборка=Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	    НоваяСтрока=Товары.Добавить();
		НоваяСтрока.НаименованиеТовара=Выборка.Товар;
		НоваяСтрока.Количество=Выборка.Количество;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//Строка=Товары.Получить(ВыбраннаяСтрока);
	//Форма=ПолучитьФорму("ОбщаяФорма.ФормаЗаказанногоТовара");
	//Форма.НаименованиеТовара=Строка.НаименованиеТовара;
	//Форма.Количество=Строка.Количество;
	//Форма.Открыть();
	
	Строка=Товары.Получить(ВыбраннаяСтрока);
	Форма=ПолучитьФорму("ОбщаяФорма.ФормаТовара");
	Форма.НаименованиеТовара=Строка.НаименованиеТовара;
	Форма.Открыть();
КонецПроцедуры
