
&НаСервере
Процедура ПриОткрытииНаСервере()
	Выборка = Справочники.Товары.Выбрать();
	Пока Выборка.Следующий() Цикл
	    НоваяСтрока=Товары.Добавить();
		НоваяСтрока.Наименование=Выборка.Ссылка;
		НоваяСтрока.Остаток=Выборка.Остатки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Строка=Товары.Получить(ВыбраннаяСтрока);
	Форма=ПолучитьФорму("ОбщаяФорма.ФормаТовара");
	Форма.НаименованиеТовара=Строка.Наименование;
	Форма.Открыть();
КонецПроцедуры


&НаКлиенте
Процедура ПерейтиВКорзину(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаКорзины");
КонецПроцедуры

