
&НаСервере
Процедура ПриОткрытииНаСервере()
	Заказы.Очистить();
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	Заказы.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.Заказы КАК Заказы
	             |ГДЕ
	             |	Заказы.Проведен = ИСТИНА";
	Результат=Запрос.Выполнить();
	Выборка=Результат.Выбрать();
	Пока Выборка.Следующий() Цикл	    
		НоваяСтрока=Заказы.Добавить();
		НоваяСтрока.НаименованиеЗаказа=Выборка.Ссылка;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Строка=Заказы.Получить(ВыбраннаяСтрока);
	Форма=ПолучитьФорму("ОбщаяФорма.ФормаЗаказа");
	Форма.НаименованиеЗаказа=Строка.НаименованиеЗаказа;
	Форма.Открыть();
КонецПроцедуры
