
&НаСервере
Процедура ПриОткрытииНаСервере()
	Если ПустаяСтрока(Константы.Корзина.Получить()) Тогда
		Возврат;
	КонецЕсли;
	Товары.Очистить();
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ЗаказыТовары.Товар КАК Товар,
	             |	ЗаказыТовары.Количество КАК Количество
	             |ИЗ
	             |	Документ.Заказы.Товары КАК ЗаказыТовары
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заказы КАК Заказы
	             |		ПО ЗаказыТовары.Ссылка = Заказы.Ссылка
	             |ГДЕ
	             |	Заказы.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Константы.Корзина.Получить());
	Результат=Запрос.Выполнить();
	Выборка=Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	    НоваяСтрока=Товары.Добавить();
		НоваяСтрока.НаименованиеТовара=Выборка.Товар;
		НоваяСтрока.Количество=Выборка.Количество;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	ПриОткрытииНаСервере();
КонецПроцедуры
